20231225083210-java_boxing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Java Boxing</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Java Boxing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ab1162">1. Boxing</a></li>
<li><a href="#orga519a29">2. Unboxing</a></li>
</ul>
</div>
</div>
<p>
<code>Boxing</code> and <code>unboxing</code> conversions allow interoperability between <a href="20231230083124-primitive_types.html#ID-46582863-7f97-448d-bbc7-f7da4c1e7574">Primitive Type</a> values and their representation as objects of the <code>wrapper types</code>
</p>

<div id="outline-container-org3ab1162" class="outline-2">
<h2 id="org3ab1162"><span class="section-number-2">1.</span> Boxing</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Boxing (aka autoboxing)</b> conversion converts the value of a <code>primitive</code> type to a corresponding value of its <code>Wrapper type</code>.
</p>
</div>
</div>

<div id="outline-container-orga519a29" class="outline-2">
<h2 id="orga519a29"><span class="section-number-2">2.</span> Unboxing</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Unboxing</b> conversion converts the value of a <code>wrapper</code> type to a value of its corresponding <code>primitive</code> type.
</p>

<p>
Both <b>boxing</b> and <b>unboxing</b> conversion are applied <b>implicitly</b> in the right context, but the <code>wrapper</code> classes also provide the static method <code>valueOf()</code> to explicitly box a <code>primitive</code> value in a <code>wrapper</code> object, and the method <code>primitiveTypeValue()</code> to <b>explicitly</b> unbox the value in a <code>wrapper</code> object as a value of <code>primitiveType</code>.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org64b69d0"><span class="org-comment-delimiter">// </span><span class="org-comment">Boxing
</span><span class="org-type">Integer</span> <span class="org-variable-name">iRef</span> = 10;  <span class="org-comment-delimiter">// </span><span class="org-comment">(1) Implicit boxing: Integer &lt;----- int
</span><span class="org-type">Double</span> <span class="org-variable-name">dRef</span> = Double.valueOf(3.14); <span class="org-comment-delimiter">// </span><span class="org-comment">(2) Explicit boxing: Double &lt;----- double
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Unboxing
</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = iRef; <span class="org-comment-delimiter">// </span><span class="org-comment">(3) Implicit unboxing: int &lt;----- Integer
</span><span class="org-type">double</span> <span class="org-variable-name">d</span> = dRef.doubleValue(); <span class="org-comment-delimiter">// </span><span class="org-comment">(4) Explicit unboxing: double &lt;----- Double</span>
</pre>
</div>

<p>
Note that <b>both</b> <code>boxing</code> and <code>unboxing</code> are done <b>implicitly</b> in the right context.
</p>

<p>
<b>Boxing</b> allows <code>primitive</code> values to be used where an object of their <code>wrapper type</code> is expected, and <b>unboxing</b> allows the converse.
</p>

<p>
<b>Unboxing</b> makes it possible to:
</p>
<ul class="org-ul">
<li>Use a <code>Boolean wrapper</code> object as a <code>boolean</code> value in a boolean expression</li>
<li>Use an <code>Integral wrapper</code> object as an <code>integral primitive value</code> in an arithmetic expression.</li>
</ul>

<p>
Unboxing a <code>wrapper</code> reference that has the null value <b>results in a</b> <code>NullPointer-Exception</code>.
</p>
</div>
</div>
</div>
</body>
</html>
